/**
 * 新宿駅付近で適当に選んだサンプルデータ
 * 住所、緯度、経度の他は全て適当な値。
 */

module.exports = makeSampleData([
  ['東京都新宿区内藤町８７',          35.687503, 139.714451],
  ['東京都新宿区新宿４丁目１−１３',   35.689525, 139.702379],
  ['東京都新宿区、新宿3-30-13',       35.691154, 139.703999],
  ['東京都新宿区新宿３−２−１',        35.690222, 139.706499],
  ['東京都新宿区西新宿３−２−９',      35.686922, 139.693024],
  ['東京都新宿区西新宿３丁目７−２１', 35.684522, 139.690873],
  ['東京都新宿区西新宿６−１',         35.694059, 139.690637]
]);

function makeSampleData(places) {
  return places.map((place, idx) => {
    return {
      id: idx + 1,
      code: `B-012320${idx}`,
      name: `サンプル建物-${idx}`,
      address: place[0],
      latitude: place[1],
      longitude: place[2]
    }
  });
}
